; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
)
)
)

; plan
1. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 9 of 17
2. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 9 of 17
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 9 of 17
4. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 10 of 17
5. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 11 of 17
6. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 11 of 17
7. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 11 of 17
8. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 11 of 17
9. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 11 of 17
10. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 12 of 17
11. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 13 of 17
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 17
13. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 17
14. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 13 of 17
15. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 13 of 17
16. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 17
17. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 14 of 17
18. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 15 of 17
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 17
20. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 15 of 17
21. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 15 of 17
22. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 17
23. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 16 of 17
24. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 17 of 17
